/*
 * Задача 1
 * Реализовать консольное приложение, которое:
 * 1. Принимает от пользователя строку вида
 * text~num
 * 1. Нужно рассплитить строку по ~, сохранить text в связный список на позицию
 * num.
 * 2. Если введено print~num, выводит строку из позиции num в связном списке и
 * удаляет её из списка.
 */





 
 /* Задача 2
 * Реализовать консольное приложение, которое:
 * 1. Принимает от пользователя и “запоминает” строки.
 * 2. Если введено print, выводит строки так, чтобы последняя введенная была
 * первой в списке, а первая - последней.
 * 3. Если введено revert, удаляет предыдущую введенную строку из памяти.
 * 
 * Задача 3
 * 1) Написать метод, который принимает массив элементов, помещает их в
 * стэк и выводит на консоль содержимое стэка.
 * 2) Написать метод, который принимает массив элементов, помещает их в очередь
 * и выводит на консоль содержимое очереди.
 * 
 * Задача 4
 * Реализовать стэк с помощью массива. Нужно реализовать методы:
 * size(), empty(), push(), peek(), pop().
 * 
 * Задача 5
 * Реализовать алгоритм перевода из инфиксной записи в постфиксную для
 * арифметического выражения.
 * [http://primat.org/news/obratnaja_polskaja_zapis/2016-04-09-1181](http://
 * primat.org/news/obratnaja_polskaja_zapis/2016-04-09-1181)
 * Вычислить запись если это возможно.
 */